Revit 2026 API
Application.Cities Property
Returns a set of all the known city locations within Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public CitySet Cities { get; }
Public ReadOnly Property Cities As CitySet
	Get
public:
property CitySet^ Cities {
	CitySet^ get ();
}
member Cities : CitySet with get
Property Value
CitySet
Remarks
Each city has information about longitude, latitude etc.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace